#+TITLE: Strategic Initiatives
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@cncf.io
#+BEGIN_NOTES
We will cover:
- Conformance Programs
- Contributor Infrastructure
- Collaborative Tooling
#+END_NOTES
* Set up :noexport:
Run reveal-multiplex locally
#+begin_src tmate :window reveal-multiplex
docker run -it --rm -p 1948:1948 registry.gitlab.com/ii/nz/reveal-multiplex
#+end_src

Set env for local reveal-multiplex server
#+begin_src elisp
(setenv "MULTIPLEX_URL" "http://localhost:1948")
(normal-mode)
#+end_src

Link up this folder to the web
#+begin_src tmate :window napa
export SHARINGIO_PAIR_EXPOSER_HOSTNAME=napa APP_METRICS_ENABLED=false
echo "Talk available at: http://$SHARINGIO_PAIR_EXPOSER_HOSTNAME.${SHARINGIO_PAIR_BASE_DNS_NAME:-127.0.0.1.sslip.io:8080}"
go-http-server
#+end_src

Generate a token
#+begin_src shell
curl -s ${MULTIPLEX_URL:-reveal-multiplex.glitch.me}/token | jq .
#+end_src

#+RESULTS:
#+begin_example
{
  "secret": "",
  "socketId": ""
}
#+end_example
